In [65]:
import pandas as pd
import os
import glob

In [7]:
df = pd.read_csv('Historical_data.csv')

In [12]:
df.head()

        Date     Price      Open      High       Low Change %
0  10-Jan-00  1,457.60  1,441.50  1,464.40  1,441.50    1.12%
1  11-Jan-00  1,438.60  1,457.60  1,458.80  1,434.40   -1.30%
2  12-Jan-00  1,432.20  1,439.10  1,445.30  1,427.30   -0.44%
3  13-Jan-00  1,449.70  1,432.20  1,454.60  1,432.20    1.22%
4  14-Jan-00  1,465.20  1,449.70  1,473.00  1,449.70    1.07%

In [13]:
df.tail()

           Date     Price      Open      High       Low Change %
4995  15-Nov-19  3,120.46  3,107.92  3,120.46  3,104.60    0.77%
4996  18-Nov-19  3,122.03  3,117.91  3,124.17  3,112.06    0.05%
4997  19-Nov-19  3,120.18  3,127.45  3,127.64  3,113.47   -0.06%
4998  20-Nov-19  3,108.46  3,114.66  3,118.97  3,091.41   -0.38%
4999  21-Nov-19  3,103.54  3,108.49  3,110.11  3,094.55   -0.16%

In [15]:
df.dtypes

Date        object
Price       object
Open        object
High        object
Low         object
Change %    object
dtype: object

In [16]:
df.describe()

             Date     Price      Open      High       Low Change %
count        5000      4997      4995      4997      4997     4998
unique       5000      4731      4735      4715      4717      647
top     14-Dec-18  1,130.50  1,130.50  1,198.80  1,171.40    0.00%
freq            1         4         4         5         6       40

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      5000 non-null   object
 1   Price     4997 non-null   object
 2   Open      4995 non-null   object
 3   High      4997 non-null   object
 4   Low       4997 non-null   object
 5   Change %  4998 non-null   object
dtypes: object(6)
memory usage: 234.5+ KB

In [45]:
df.isna().sum()

Date        0
Price       3
Open        5
High        3
Low         3
Change %    2
dtype: int64

### NULL = NA

In [47]:
df.fillna(0, inplace=True)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      5000 non-null   datetime64[ns]
 1   Price     5000 non-null   float64
 2   Open      5000 non-null   float64
 3   High      5000 non-null   float64
 4   Low       5000 non-null   float64
 5   Change %  5000 non-null   float64
dtypes: datetime64[ns](1), float64(5)
memory usage: 273.4 KB

In [24]:
df['Price'] = df['Price'].str.replace(',','')
df['Price'] = pd.to_numeric(df['Price'])

In [26]:
df.dtypes

Date         object
Price       float64
Open         object
High         object
Low          object
Change %     object
dtype: object

In [27]:
df.columns

Index(['Date', 'Price', 'Open', 'High', 'Low', 'Change %'], dtype='object')

In [29]:
col = ['Open', 'High', 'Low']
for column in col:
    df[column] = df[column].str.replace(',','')
    df[column] = pd.to_numeric(df[column])

In [30]:
df.dtypes

Date         object
Price       float64
Open        float64
High        float64
Low         float64
Change %     object
dtype: object

In [33]:
df['Date'] = pd.to_datetime(df['Date'])

In [34]:
df.dtypes

Date        datetime64[ns]
Price              float64
Open               float64
High               float64
Low                float64
Change %            object
dtype: object

In [36]:
df['Change %'] = df['Change %'].str.replace('%','')
df['Change %'] = pd.to_numeric(df['Change %'])
df['Change %'] = df['Change %']/100

In [37]:
df.dtypes

Date        datetime64[ns]
Price              float64
Open               float64
High               float64
Low                float64
Change %           float64
dtype: object

In [38]:
df.head()

        Date   Price    Open    High     Low  Change %
0 2000-01-10  1457.6  1441.5  1464.4  1441.5    0.0112
1 2000-01-11  1438.6  1457.6  1458.8  1434.4   -0.0130
2 2000-01-12  1432.2  1439.1  1445.3  1427.3   -0.0044
3 2000-01-13  1449.7  1432.2  1454.6  1432.2    0.0122
4 2000-01-14  1465.2  1449.7  1473.0  1449.7    0.0107

In [39]:
df.tail()

           Date    Price     Open     High      Low  Change %
4995 2019-11-15  3120.46  3107.92  3120.46  3104.60    0.0077
4996 2019-11-18  3122.03  3117.91  3124.17  3112.06    0.0005
4997 2019-11-19  3120.18  3127.45  3127.64  3113.47   -0.0006
4998 2019-11-20  3108.46  3114.66  3118.97  3091.41   -0.0038
4999 2019-11-21  3103.54  3108.49  3110.11  3094.55   -0.0016

In [42]:
df.sort_values(by='Date', inplace=True)

## OR

In [43]:
df = df.sort_values(by = 'Date')

           Date    Price     Open     High      Low  Change %
0    2000-01-10  1457.60  1441.50  1464.40  1441.50    0.0112
1    2000-01-11  1438.60  1457.60  1458.80  1434.40   -0.0130
2    2000-01-12  1432.20  1439.10  1445.30  1427.30   -0.0044
3    2000-01-13  1449.70  1432.20  1454.60  1432.20    0.0122
4    2000-01-14  1465.20  1449.70  1473.00  1449.70    0.0107
...         ...      ...      ...      ...      ...       ...
4995 2019-11-15  3120.46  3107.92  3120.46  3104.60    0.0077
4996 2019-11-18  3122.03  3117.91  3124.17  3112.06    0.0005
4997 2019-11-19  3120.18  3127.45  3127.64  3113.47   -0.0006
4998 2019-11-20  3108.46  3114.66  3118.97  3091.41   -0.0038
4999 2019-11-21  3103.54  3108.49  3110.11  3094.55   -0.0016

[5000 rows x 6 columns]

In [49]:
df.describe()

             Price         Open         High          Low     Change %
count  5000.000000  5000.000000  5000.000000  5000.000000  5000.000000
mean   1566.026324  1565.240116  1574.718160  1556.238572     0.000220
std     577.579617   578.340859   578.270345   576.552376     0.011896
min       0.000000     0.000000     0.000000     0.000000    -0.090300
25%    1149.892500  1149.000000  1157.800000  1140.575000    -0.004700
50%    1357.820000  1357.205000  1366.470000  1346.525000     0.000500
75%    1977.872500  1976.682500  1985.080000  1966.492500     0.005700
max    3122.030000  3127.450000  3127.640000  3113.470000     0.115800

## Load Miltiple files

In [50]:
path = 'C:/Users/AmirSaeed/Desktop/python_session/files/'

In [89]:
os.chdir(path)

In [55]:
os.listdir(path) ## If all files to be combied are in same format

['kpi1_20220101.csv',
 'kpi1_20220102.csv',
 'kpi1_20220103.csv',
 'kpi1_20220104.csv',
 'kpi1_20220105.csv',
 'kpi1_20220106.csv',
 'kpi1_20220107.csv',
 'kpi2_20220101.csv',
 'kpi2_20220102.csv',
 'kpi2_20220103.csv',
 'kpi2_20220104.csv']

### If files are in different format

In [92]:
for file in glob.glob("kpi1*"):
    print(file)

kpi1_20220101.csv
kpi1_20220102.csv
kpi1_20220103.csv
kpi1_20220104.csv
kpi1_20220105.csv
kpi1_20220106.csv
kpi1_20220107.csv

In [93]:
kpi1 = pd.DataFrame()
for file in glob.glob("kpi1*"):
    print(path+file)
    kpi1 = pd.concat([kpi1, pd.read_csv(path+file)])

C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220101.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220102.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220103.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220104.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220105.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220106.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi1_20220107.csv

In [94]:
kpi1

       Date   KPI  value
0  1/1/2022  kpi1  80.36
0  1/2/2022  kpi1  56.32
0  1/3/2022  kpi1  67.16
0  1/4/2022  kpi1  15.34
0  1/5/2022  kpi1  96.81
0  1/6/2022  kpi1  20.37
0  1/7/2022  kpi1  69.71

In [95]:
kpi2 = pd.DataFrame()
for file in glob.glob("kpi2*"):
    print(path+file)
    kpi2 = pd.concat([kpi2, pd.read_csv(path+file)])

C:/Users/AmirSaeed/Desktop/python_session/files/kpi2_20220101.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi2_20220102.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi2_20220103.csv
C:/Users/AmirSaeed/Desktop/python_session/files/kpi2_20220104.csv

In [96]:
kpi2

       Date   KPI category  value
0  1/1/2022  kpi2     cat1  943.9
1  1/1/2022  kpi2     cat2  794.4
0  1/2/2022  kpi2     cat1  365.8
1  1/2/2022  kpi2     cat2  174.0
0  1/3/2022  kpi2     cat1  532.7
1  1/3/2022  kpi2     cat2  685.9
0  1/4/2022  kpi2     cat1   29.8
1  1/4/2022  kpi2     cat2  725.6